# Analytical Distribution Node Property Data Properties

Source: https://www.revitapidocs.com/2026/f50c1cf5-f80e-c2c2-93d7-601d074dc96c.htm

---

| Analytical Distribution Node Property Data Properties |
| --- |

The AnalyticalDistributionNodePropertyData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top See Also

#### Reference

AnalyticalDistributionNodePropertyData Class Autodesk.Revit.DB.Electrical Namespace